#!/usr/bin/python3
# -*- coding: utf-8 -*-


import math



print ('''

 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
|                                                                             |
|                                                                             |
|                                      _         _ _                          |
|                                     | |       (_) |                         |
|                      ___ _ __  _   _| |_ _ __  _| | __                      |
|                     / __| '_ \| | | | __| '_ \| | |/ /                      |
|                     \__ \ |_) | |_| | |_| | | | |   <                       |
|                     |___/ .__/ \__,_|\__|_| |_|_|_|\_|                      |
|                         | |                                                 |
|                         |_|                                                 |
|              Программа для определения направления на спутник               |
|                                                                             |
|                                                                             |
|    Данная программа предназначенна для определения направления на спутник   |
|                                                                             |
|  1)После запроса программы введите местоположение спутника,                 |
|    западная долгота вводится со знаком -                                    |
|    Например: -11 -97 -46                                                    |
|  2)После запроса программы введите местоположение антенны                   |
|                                                                             |
|                                                                             |
|_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _|


                                  &         Описание программы смотри выше ⇑
                              @@  ,@
                           @@ &%   %@
                          @.   ,@&   @
                           @@@   @   @@
                             @   #@    @
                              @@   @  %@@.
                               @   @@    &@
                                @    @* @@ @@,@,@
                                 @  #@, @@@@@@ @@,
                                  @ @@@@@@@@@@@ @@
                               @@@@@@@@@@@@@@@
                       @@ @@    @@@@@@@@@@  @@ @
                       @@ @@ @@  @@@@@@ @@ @    @*
                       *@  @  @@  @@@  @    @ @  %@
                        @@  @@     (@   @ @@ @*   *@
                          @@  %%         @    #@@   @
                            @@@           @&@   @   @@
                                           ,@   *@    @
                                             @@   @  /@(
                                              @   @@
                                               @#
                                              ''')




SpGeoDol = float(input('Введите долготу спутника: '))
GeoShir = float(input('Введите широту места приема: '))
GeoDolq = float(input('Введите долготу места приема: '))





print ()
print ()
print ()

print ('''Направление на спутник:''')
print ()

#определяем азимут

tan1 = math.tan((GeoDolq - SpGeoDol) * math.pi/180)

sin1 = math.sin(GeoShir * math.pi / 180)

atan1 = math.atan(tan1 / sin1) * (180/math.pi)

print('Азимут :',180 + atan1)


#определяем угол места

cos2 = math.cos((GeoDolq - SpGeoDol)* math.pi / 180) * (math.cos((GeoShir)*math.pi/180)) - 0.151;

sqrt2 = math.sqrt(1- (math.pow(math.cos((GeoDolq - SpGeoDol) * math.pi/180), 2 ) * math.pow(math.cos(GeoShir*(math.pi/180)),2)));

atan2 = math.atan(cos2 / sqrt2) * (180 / math.pi);

print('Угол места :', atan2 )

input ()
